app/Controllers/userController.php

SELECT *
FROM `user`
WHERE `email` IS NULL
AND `codigo_verificacao` = 130699
 LIMIT 1
---
    public function verifyCode()
    {
        $code = $this->request->getPost('code');
        $email = session()->get('email');
        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->where('codigo_verificacao', $code)->first();